<!DOCTYPE html>
<html lang="en">
<head>
  <title>نامیلکە</title>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  
	<link rel="stylesheet" type="text/css" href="../../../CSS/design_milakat_1.css">
	<link href="../../../need/magicsuggest/magicsuggest.css" rel="stylesheet">
	<link rel="stylesheet" type="text/css" 		 href="../../../need/DataTables/media/css/jquery.dataTables.css"> 
	<script src="../../../need/jquery/jquery-1.12.0.js"></script>
	<style type="text/css">
   .text2 a:hover  {
                background:#337ab7;
               color: white !important;
                text-decoration: none !important;
               
            }
  .textdeco{
            	    text-decoration: none !important;

            }
  
  .text2 a:focus  {
                background:#337ab7 !important;
                color: white !important;
                 text-decoration: none !important;
            }
    .text2 a
    { 
    	color:#9d9d9d !important;
    	font-size: 13px !important;
        word-spacing: 2px !important;

    }
    .text
    { 
    	color: white !important;
    	font-size: 16px !important;
        word-spacing: 2px !important;
    }
    h4,h2,h5{
    	color: #383838 !important;
    	font-weight: bold !important;
    }
  </style>
</head>
<body class="color " >
<?php 
	include("header_ku_hr.php");
	include("../../../database.php");
?>

<div class="container">

	<div class="row">
<div class="col-lg-2 col-md-2 col-sm-3 ">
	<div class="text2 textdeco" >
	<br/><br/>
<h4>ناوەڕۆک</h4><br/>	
<a  href="#1" >پێشه‌كیی   </a><br/><br/>
<a  href="#2">به‌شی یه‌كه‌م : چوونه‌ ژووره‌وه‌ </a><br/><br/>
<a  href="#3">چوونه‌ ژووره‌وه‌	                              <br/>	</a><br/>
<a  href="#4">وه‌رگرتنی ناوی به‌كارهێنه‌ر و ژماره‌ی نهێنی	         <br/>	</a><br/>
<a  href="#5">یه‌كه‌م چوونه‌ ژووره‌وه‌	                             <br/>	</a><br/>
<a  href="#6">پاراستن له‌ زانیاری هه‌ڵه‌ (Data Validation)	     <br/>	</a><br/>
<a  href="#7">گۆرینی ژماره‌ی نهێنی                           <br/>	</a><br/>
<a  href="#8">له‌بیرچوونی ژماره‌ی نهێنی(password)             <br/>	</a><br/>
<a  href="#9">له‌بیرچوونی ناوی به‌كارهێنه‌ر(username)           <br/>	</a><br/>
<a  href="#10">جۆری به‌كارهێنه‌ر	                             <br/>	</a><br/>
<a  href="#11">به‌شی به‌كارهێنه‌ری ئاسایی	                     <br/>	</a><br/>
<a  href="#12">زانیاری كه‌سی	                                <br/>	</a><br/>
<a  href="#13">خشته‌ی مووچه‌	                                 <br/>	</a><br/>
<a  href="#14">به‌شی خزمه‌ت                                   <br/>	</a><br/>
<a  href="#15">زمان	                                         <br/>	</a><br/>
<a  href="#16">ژماره‌ی نهێنی	                                 <br/>	</a><br/>
<a  href="#17">په‌یوه‌ندیمان پێوه‌ بكه‌                          <br/>	</a><br/>
<a  href="#18">چوونه‌ ده‌ره‌وه‌	                                 <br/>	</a><br/>
<a  href="#19">به‌شی میلاكت (HR)	                             <br/>	</a><br/>
<a  href="#20">زیادكردنی فه‌رمانبه‌ری نوێ	                    <br/>	</a><br/>
<a  href="#21">رێكخستن	                                     <br/>	</a><br/>
<a  href="#22">خشته‌ی مووچه‌	                                 <br/>	</a><br/>
<a  href="#23">یاساكانی بڕوانامه‌	                             <br/>	</a><br/>
<a  href="#24">نامه‌كانی به‌كارهێنه‌ر	                         <br/>	</a><br/>
<a  href="#25">پیشاندان و گۆرین                        	     <br/>	</a><br/>
<a  href="#26">رێكخستنی وشه‌ی نهێنی	                     <br/> </a><br/>
<a  href="#27">خزمه‌ت	                                     <br/></a><br/>
<a  href="#28">سه‌رمووچه‌ی ساڵانه‌	                             <br/>	</a><br/>
<a  href="#29">به‌رزكردنه‌وه‌ی مووچه‌                              <br/>	</a><br/>
<a  href="#30">هه‌ژماری راژه‌	                                  <br/>	</a><br/>
<a  href="#31">پێشخستن	                                  <br/>	</a><br/>
<a  href="#32">بڕوانامه‌                                        <br/>	</a><br/>
<a  href="#33">مۆڵه‌ت	                                      <br/>	</a><br/>
</div>
	</div>

<br><br>
	<div class="col-lg-10 col-md-10 col-sm-9 ">
	<div class="text">
		<p>
			<h4 id="1">پێشه‌كیی</h4><br>
ئه‌م سیسته‌مه‌ دروستكراوه‌ بۆ به‌شی میلاكاتی كۆلێژی ئه‌ندازیاری زانكۆی سه‌ڵاحه‌ین له‌ هه‌ولێر ، له‌لایه‌ن قوتابیانی پۆلی 4 یی به‌شی سۆفتوێر ، كه‌ به‌شێكه‌ له‌ پرۆژه‌ی پۆلی 4 یی قوتابیان ، ئه‌م سیسته‌مه‌ له‌سه‌ر ئینته‌رنێت كارده‌كات (Web Application)  ، به‌كاردێت بۆ به‌رێوه‌بردنی ئه‌و كاروبارانه‌ی كه‌ په‌یوه‌ندی به‌ به‌شی میلاكات هه‌یه‌ ، سیسته‌مه‌كه‌ له‌ دوو به‌شی سه‌ره‌كی پێكدێت ، به‌شی یه‌كه‌م تایبه‌ته‌ به‌ فه‌رمانبه‌ری ئاسایی (user) ، ئه‌و جۆره‌ فه‌رمانبه‌رانه‌ ته‌نها ده‌توانن زانیاریه‌كانیان ببینن و ناتوانن هیچ جۆره‌ فه‌رمانێك(action) ێك ، له‌سه‌ر سیسته‌مه‌كه‌ بكه‌ن‌ (له‌خواره‌وه‌ به‌شه‌كانی به‌ درێژی باسده‌كرێت) ، به‌شی دووه‌م تایبه‌ته‌ به‌ فه‌رمانبه‌ری به‌شی میلاكات ، له‌م به‌شه‌ تایبه‌ته‌ به‌ جێبه‌جێ كردنی كار وفه‌رمانه‌كانی به‌شی میلاك(له‌خواره‌وه‌ به‌شه‌كانی به‌ درێژی باسده‌كرێت) ، ئه‌م سیسته‌مه‌ به‌هه‌ر سێ زمانی كوردی و عه‌ره‌بی و ئینگلیزی دروستكراوه‌ ، به‌كارهێنه‌ر ده‌توانێ به‌ ئاره‌زووی خۆی یه‌كێك له‌و زمانانه‌ هه‌ڵبژێرێ.

		

		<br/><br/><h4 id="2">به‌شی یه‌كه‌م : چوونه‌ ژووره‌وه‌ </h4><br/>
ئه‌م سیسته‌مه‌ له‌سه‌ر ئینته‌رنێت كارده‌كات ، واتا ته‌نها فه‌رمانبه‌ر كاتێك ده‌توانێت بچێته‌ ناو سیسته‌مه‌كه‌ كه‌ ئه‌و ئامێره‌ی به‌كاریده‌هێنی (كۆمپیته‌ر،مۆبایل،....) ، په‌یوه‌ست(connect)  بووبێ به‌ ئینته‌رێـت ، له‌م جۆره‌ سیسته‌مانه‌ چۆنیه‌تی چوونه‌ ژووره‌وه‌ی به‌كارهێنه‌ر و پاراستنی زانیاریه‌كانی له‌ رووبه‌روو بوونه‌وه‌ی هێرش(Hacking) ، به‌شێكی گرینگی سیسته‌مه‌كه‌یه‌ ، بۆیه‌ هه‌وڵمانداوه‌ به‌باشترین شێوه‌ به‌كارهێنه‌ر بپارێزین ، له‌هه‌ر رووداوێكی نه‌خوازراو كه‌ ببێته‌ هۆی زیانگه‌یاندن به‌به‌كارهێنه‌ر( بۆنمونه‌ دیتنی زانیاریه‌كانی له‌لایه‌ن كه‌سێكه‌وه‌ كه‌ بۆی نه‌بێ ئه‌و زانیاریانه‌ ببینێ ) ، گرینگترین فه‌رمانه‌كانی ئه‌م به‌شه‌ له‌خواره‌وه‌ روونكراوه‌ته‌وه‌ :-
<br/><br/><h4 id="3">چوونه‌ ژووره‌وه‌ </h4><br>
•	هه‌ر به‌كارهێنه‌رێك بیه‌وێت بچێته‌ ناو ئه‌م سیسته‌مه‌ ، پێویستی به‌هه‌بوونی ناوی به‌كارهێنه‌ر (username) و ژماره‌ی نهێنی(password) هه‌یه‌  ، پاش داخیلی كردنی ئه‌و زانیاریانه‌ له‌لایه‌ن به‌كارهێنه‌ر له‌به‌شی چوونه‌ژووره‌وه‌ ، ئه‌گه‌ر به‌كارهێنه‌ر پێشتر ناوی له‌ سیسته‌مه‌كه‌ تۆماركرابێت ئه‌وا ده‌توانێت داخیلی ناو سیسته‌مه‌كه‌ بێـت و به‌شی فه‌رمانبه‌ری ئاسی بۆ ده‌كرێته‌وه‌ ، وه‌ ئه‌گه‌رنا سیسته‌مه‌كه‌ رێگای پێنادات بچێته‌ ژووره‌وه‌.
<br/><br/><h4 id="4">وه‌رگرتنی ناوی به‌كارهێنه‌ر و ژماره‌ی نهێنی</h4><br/>
•	ئه‌م سیسته‌مه‌ سیسته‌مێكی گشتی نیه‌ و هه‌موو كه‌سێك بۆی نیه‌ داخیلی ناو سیسته‌مه‌كه‌ بێت و زانیاریه‌كان ببینێت ، ته‌نها ئه‌و كه‌سانه‌ توانه‌ی چوونه‌ژووره‌وه‌یان هه‌یه‌ كه‌ فه‌رمانبه‌ربن له‌كۆلێژی ئه‌ندازیاری زانكۆی سه‌ڵاحه‌ین و پێشتر ناویان له‌وێ تۆماركرابێـت ، بۆیه‌ به‌كارهێنه‌ر بۆ به‌ده‌ست هێنانی ناوی به‌كارهێنه‌ر و ژماره‌ی نهێنی پێویسته‌ سه‌ردانی به‌شی میلاكاتی كۆلێژی ئه‌ندازیاری بكات. (له‌به‌شی میلاكات باسی چۆنیه‌تی دروستكردنی ناوی به‌كارهێنه‌ر و ژماره‌ی نهێنی ده‌كه‌ین)
<br/><br/><h4 id="5">یه‌كه‌م چوونه‌ ژووره‌وه‌</h4><br/>
•	هه‌ر به‌كارهێنه‌رێك كاتێك بۆ یه‌كه‌مین جار ده‌چێته‌ ناو سیسته‌مه‌كه‌ ، له‌لایه‌ن سیسته‌مه‌كه‌وه‌ داوای لێده‌كرێت كه‌ ناوی به‌كارهێنه‌ر و ژماره‌ی نهێنی بگۆرێت ، ئه‌م گۆرینه‌ش زۆرگرینگه‌ بۆ پاراستنی به‌كارهێنه‌ر چونكه‌ ژماره‌ی نهێنی و ناوی به‌كارهێنه‌ر له‌لایه‌ن به‌شی میلاكات وه‌ریگرته‌وه‌ (واتا زانیاریه‌كان شاراوه‌ نیه‌ و تایبه‌ت نین به‌ به‌كارهێنه‌ر) ، فه‌رمانبه‌ر ده‌توانێ به‌شه‌كانی دیكه‌ له‌به‌شی فه‌رمانبه‌ری ئاسای ببینێـت هه‌رچه‌نده‌ ژماره‌ی نهێنی و ناوی به‌كارهێنه‌ری نه‌گۆریبێت ، به‌ڵام هه‌ر جارێكی تر به‌كارهێنه‌ر چووه‌ ناو سیسته‌مه‌كه‌ هه‌مان داواكاری لێ دوباره‌ ده‌كرێته‌وه‌ تا ئه‌و كاته‌ی زانیاریه‌كانی ده‌گۆرێت.
<br/><br/><h4 id="6">پاراستن له‌ زانیاری هه‌ڵه‌ (Data Validation)</h4><br/>
•	زۆرگرینگه‌ له‌هه‌ربه‌شێكی ناو سیسته‌مه‌ به‌كارهێنه‌ر زانیاری دروست به‌كاربهێنێت بۆ ئه‌وه‌ی سیسته‌مه‌كه‌ به‌شێوه‌یه‌كی ته‌واو و بێ كێشه‌ ئیشه‌كانی خۆی بكات ، بۆیه‌ له‌به‌شی چوونه‌ ژووره‌وه‌ چه‌ند یاساێكمان هه‌یه‌ كه‌ ده‌بێت به‌كارهێنه‌ر پابه‌ندی بێت له‌كاتی چوونه‌چووره‌وه‌ی بۆ ناو سیسته‌مه‌كه‌ ، بۆنمونه‌ نابێت ژماره‌ی نهێنی له‌ 8 پیت یان ژماره‌ كه‌متربێت ، یاخود نابێت ناوی به‌كارهێنه‌ر ژماره‌ی تێدابێـت ، له‌كاتی بوونی ئه‌م جۆره‌ هه‌ڵانه‌ ئه‌و سیسته‌مه‌كه‌ ئاگاداری ده‌دات به‌ به‌كارهێنه‌ر كه‌ زانیاریه‌كانی نادروستن ، ئه‌م دوو وێنه‌ی خواره‌وه‌ جیاوازی نێوان زانیاری دروست و نادروست پیشان ده‌دات ...
<br/><br/>
 <img src="../../../image/1.png" alt="photo" class="center-block img-responsive" />
 <br/><br/>
 <img src="../../../image/2.png" alt="photo" class="center-block img-responsive" />
<br/><br/>
<h4 id="7">گۆرینی ژماره‌ی نهێنی</h4><br/>
•	جگه‌ له‌كاتی یه‌كه‌م چوونه‌ ژووره‌وه‌ (كه‌ له‌سه‌ره‌وه‌ باسكرا) ، به‌كارهێنه‌ر هه‌ركاتێك بیه‌وێت ده‌توانێت له‌به‌شی ژماره‌ی نهێنێ (password) ، ناوی به‌كارهێنه‌ر و ژماره‌ی نهێنی خۆی بگۆرێت ، وه‌ هه‌روه‌ها نابێت دوو به‌كارهێنه‌ر هه‌مان ناوی به‌كارهێنه‌ریان هه‌بێـت (بۆ نمونه‌ نابێت دوو به‌كارهێنه‌ر به‌ناوی نیاز یان هه‌ر ناوێكی دیكه‌ خه‌زن بكرێت) ، له‌كاتی بوونی ئه‌و كێشه‌یه‌ سیسته‌مه‌كه‌ به‌كارهێنه‌ر ئاگادار ده‌كاته‌وه‌ كه‌ ئه‌و ناوه‌ی به‌كارهێناوه‌ هه‌ڵه‌یه‌.
<h4 id="10">جۆری به‌كارهێنه‌ر</h4><br/>
•	له‌م سیسته‌مه‌دا دوو جۆر به‌كارهێنه‌ر هه‌یه‌ ، به‌م شێوه‌ی خواره‌وه‌ :-
1.	به‌كارهێنه‌ری ئاسای(user) : ئه‌م جۆره‌ به‌كارهێنه‌ره‌ ته‌نها ده‌توانێت زانیاریه‌كانی خۆی ببینێت وه‌ ناتوانێـت ده‌ستكاری هیچ شتێك بكات.
2.	فه‌رمانبه‌ری میلاكات(admin) : ئه‌م جۆره‌ فه‌رمانبه‌رانه‌ ده‌توانێت زانیاری هه‌موو فه‌رمانبه‌ره‌كانی ناو سیسته‌مه‌كه‌ ببینێ وه‌ هه‌ر گۆرانكاریه‌ك بیه‌وێ ، ده‌توانێ له‌ سیسته‌مه‌كه‌دا بیكات.
	له‌به‌شی میلاكات باسی چۆنیه‌تی هه‌ڵبژاردنی فه‌رمانبه‌ری ئاسای و فه‌رمانبه‌ری میلاكت ده‌كه‌ین.


 
<br/><h3 id="11">به‌شی به‌كارهێنه‌ری ئاسایی</h3><br/>
<br/><h4 id="12">زانیاری كه‌سی</h4><br/>
•	له‌م به‌شه‌دا گرینگترین زانیاریه‌ كه‌سیه‌كانی به‌كارهێنه‌ر پیشان ده‌درێت.
<br/><br/><h4 id="13">خشته‌ی مووچه‌</h4><br/>
•	ئه‌م به‌شه‌ تایبه‌ته‌ به‌ پیشان دانی ئه‌و خشته‌یه‌ی كه‌ له‌ ئێستادا له‌لایه‌ن حكومه‌تی هه‌رێمی كوردستان به‌كارده‌هێندرێت بۆ پێدانی مووچه‌ی فه‌رمانبه‌رانی ، به‌كارهێنه‌ر ده‌توانێ مووچه‌ی داهاتووی خۆی یان هه‌ر زانیاریه‌ك تر له‌م خشته‌یه‌دا ببینێ
<br/><br/><h4 id="14">به‌شی خزمه‌ت</h4><br/>
•	ئه‌م به‌شه‌ تایبه‌ته‌ پیشان دانی هه‌موو ئه‌و گۆرانكاریانه‌ی كه‌ فه‌رمانبه‌ر له‌ماوه‌ی خزمه‌تی وه‌ریگرتووه‌ ، وه‌ له‌چه‌ند به‌شێك پێك دێت ، له‌هه‌ر به‌شێك سه‌ره‌تا گرینگترین زانیاریه‌كان ده‌گه‌رێنێته‌وه‌ ئه‌گه‌ر به‌كارهێنه‌ر ئاره‌زوو بكات ده‌توانێ پاشماوه‌ی زانیاریه‌كانی دیكه‌ ببینێت به‌ كلیك كردن له‌سه‌ر ئه‌و button یی كه‌ له‌ كۆتایی هه‌ر به‌شێك هه‌یه‌..
<br/><br/>
<img src="../../../image/3.png" alt="photo" class="center-block img-responsive" />
<br/><br/>
•	وه‌ له‌م به‌شانه‌ی خواره‌وه‌ پێك دێت
1.	هه‌ژماری راژ
2.	پێشخستنی سوپاس و پێزانین
3.	پێشخستنی بڕوانامه‌
4.	به‌رزكردنه‌وه‌ی مووچه‌
5.	سه‌رمووچه‌ی ساڵانه‌
<br/><br/><h5 id="15">زمان</h5><br/>
•	له‌م به‌شه‌دا فه‌رمانبه‌ر ئه‌و زمانه‌ هه‌ڵده‌بژێرێ كه‌ ئاره‌زووی به‌كارهێنانی هه‌یه‌.
<br/><br/><h5 id="16">ژماره‌ی نهێنی</h5><br/>
•	له‌م به‌شه‌دا فه‌رمانبه‌ر ناوی به‌كارهێنه‌ر و ژماره‌ی نهێنی ده‌گۆرێـت(له‌به‌شی چوونه‌ژووره‌وه‌ باسكراوه‌)
<br/><br/><h5 id="17">په‌یوه‌ندیمان پێوه‌ بكه‌</h5><br/>
•	له‌كاتی بوونی هه‌ر كێشه‌یه‌ك له‌ زانیاریه‌كانی ئه‌و فه‌رمانبه‌ره‌ ، یاخود بوونی پرسیار یان داواكاریه‌ك فه‌رمانبه‌ر ده‌توانێ له‌م به‌شه‌دا په‌یوه‌ندی به‌ فه‌رمانبه‌ری میلاكات بكات و داواكاریه‌كه‌ی خۆی پێ رابگێنێ.
<br/><br/><h5 id="18">چوونه‌ ده‌ره‌وه‌</h5><br/>
•	له‌م به‌شه‌دا به‌كارهێنه‌ر له‌ناو سیسته‌مه‌كه‌ ده‌چێته‌ ده‌ره‌وه‌ ، بۆ دووباره‌ چوونه‌ ژووره‌وه‌ بۆ ناو سیسته‌مه‌كه‌ پێویسته‌ به‌كارهێنه‌ر دووباره‌ ژماره‌ی نهێنی و ناوی به‌كارهێنه‌ر داخیل بكاته‌وه‌.

<br/><br/><h2 id="19">به‌شی میلاكت (HR)</h2><br/>
<br/><h4 id="20">زیادكردنی فه‌رمانبه‌ری نوێ</h4><br/>
•	ئه‌م به‌شه‌ تایبه‌ته‌ به‌ پیشان دانی هه‌موو ئه‌و جۆره‌ فرمانانه‌ی كه‌ بۆ فه‌رمانبه‌ر كراوه‌ (سه‌رمووچه‌ی ساڵانه‌ ، به‌رزكردنه‌وه‌،.....) ، له‌م به‌شه‌دا فه‌رمانبه‌ری میلاكات سه‌ره‌تا ده‌بێت ناوی ئه‌و فارمه‌نبه‌ره‌ هه‌ڵبژێرێت كه‌ ده‌یه‌وێـت زانیاریه‌كانی ببینێت ، پاش كلیك كردن له‌سه‌ر دوگمه‌ شینه‌كه‌ ، ئه‌و فه‌رمانبه‌ره‌ هه‌ر چ زانیاریه‌كی له‌ناو سیسته‌مه‌كه‌ هه‌بێت ، له‌لایه‌ن سیسته‌مه‌كه‌وه‌ پیشان ده‌درێت .<br/>
<br/><h4 id="21">رێكخستن</h4><br/>
•	ئه‌م به‌شه‌ تایبته‌ به‌ رێكخستنی زانیاری یه‌كانی ناو سیسته‌مه‌كه‌ ، سیسته‌مه‌كه‌ زانیاریه‌كانی ناو ئه‌م به‌شه‌ به‌كارده‌هێنێت ، بۆ جێبه‌جێ كردنی هه‌موو ئیش و كاره‌كانی ناو سیسته‌مه‌كه‌ ، وه‌ له‌م به‌شانه‌ی خواره‌وه‌ش پێك دێت
<br/><br/><h4 id="22">خشته‌ی مووچه‌</h4><br/>
•	ئه‌م به‌شه‌ تایبه‌ته‌ به‌ پیشان دان و گۆرانكاریكردن له‌خشته‌ی مووچه‌ ، له‌ ئێستادا ئه‌م زانیاریانه‌ی تێدایه‌ كه‌ له‌ خشته‌ی مووچه‌ی حكومه‌تی هه‌رێمی كوردیستان به‌كاردێت ، له‌كاتی روودانی هه‌ر گۆرانكاریه‌ك فه‌رمه‌نبه‌ری میلاكت ده‌توانێت گۆرانكاری له‌ خشته‌كه‌دا بكات ،  به‌ كلیك له‌سه‌ر كردنی دوگمه‌(button) یی هه‌ر ریزێك ، سیسته‌مه‌كه‌ په‌نجه‌ره‌ (به‌شێكی نوێ) (window) پیشان ده‌دات ، كه‌ تیایدا به‌كارهێنه‌ر ده‌توانێت زانیاریه‌كانی ئه‌و ریزه‌ بگۆرێت ، وه‌ ئه‌م زانیاریانه‌ی تێدایه‌
<br/>1.	مووچه‌ی بنه‌ره‌تی : مووچه‌ی بنه‌ره‌تی له‌ هه‌ر پله‌یه‌ك (بۆنمونه‌ مووچه‌ی بنه‌ره‌تی پله‌ 10 له‌ 140000 ده‌گۆرێت بۆ 150000) 
<br/>2.	زیادبوونی مووچه‌ : زیادبوونی مووچه‌ له‌هه‌ر ساڵێك دا (بڕی سه‌رمووچه‌ی ساڵانه‌ی له‌و پله‌یه‌دا چه‌نده‌).
<br/>3.	ماوه‌ی به‌رزكدنه‌وه‌ : به‌چه‌ند ساڵ فه‌رمانبه‌ر له‌م پله‌یه‌ به‌رزده‌بێته‌وه‌ بۆ پله‌یه‌كی تر
<br/>•	ئه‌م وێنه‌ی خواره‌وه‌ گۆرینی زانیاریه‌كانی پله‌ 10 پیشان ده‌دات
<br/><center>	پێش گۆرانكاری</center>
 <br/><br/>
 <img src="../../../image/5.png" alt="photo" class="center-block img-responsive" />
<br/><br/>
<center>گۆرانكاری كردن </center>
<br/><br/>
 <img src="../../../image/6.png" alt="photo" class="center-block img-responsive" />
<br/><br/>
<center>دوای گۆرانكاری كردن </center>
<br/><br/>
 <img src="../../../image/7.png" alt="photo" class="center-block img-responsive" />
<br/><br/>
<h4 id="23">یاساكانی بڕوانامه‌</h4><br/>
•	یڕوانامه‌كان به‌شێكی گرینگن له‌م سیسته‌مه‌ چونكه‌ كاریگه‌ری له‌سه‌ر پله‌ و مه‌رته‌به‌ و ناونیشانی هه‌ر فه‌رمانبه‌رێك هه‌یه‌ ، ئه‌م به‌شه‌ تایبه‌ته‌ به‌ پیشان دانی بڕوانامه‌كان ، له‌م به‌شه‌دا فه‌رمانبه‌ری میلاكات ده‌توانێت سێ جۆره‌ كاربكات ، به‌م شێوه‌ی خواره‌وه‌ :-
<br/>
1.	زیادكردنی بڕوانامه‌ی نوێ : به‌كلیك كردن له‌سه‌ر دگومه‌ شینه‌كه‌ سه‌ره‌وه‌ ، په‌نجه‌ره‌ی ئه‌م به‌شه‌ ده‌بته‌وه‌ ، له‌م به‌شه‌دا فه‌رمانبه‌ر ده‌توانێت بڕوانامه‌ی نوێ زیاد بكات و له‌ سیسته‌مه‌كه‌ به‌كاری بهێنێ ، ئه‌م وێنه‌ی خواره‌وه‌ ئه‌م به‌شه‌ روون ده‌كاته‌وه‌...  
<br/><br/>
 <img src="../../../image/11.png" alt="photo" class="center-block img-responsive" />
<br/><br/>
<br/><br/>
 <img src="../../../image/12.png" alt="photo" class="center-block img-responsive" />
<br/><br/>
2.	سرینه‌وه‌ی بڕوانامه‌ :- فه‌رمانبه‌ری میلاكات له‌كاتی پێویست نه‌بوونی هه‌ر بڕوانامه‌یه‌ك ده‌توانێ ئه‌م بڕوانامه‌یه‌ بسرێته‌وه‌ ، به‌ كلیك له‌سه‌ركردنی دوگمه‌ سوره‌كه‌ی به‌رامبه‌ر بڕوانامه‌كه‌ (له‌كاتی سرینه‌وه‌ی هه‌ر بڕوانامه‌یه‌ك فه‌رمانبه‌ر ناتوانێت دوباره‌ ئه‌م بڕوانامه‌یه‌ به‌كاربهێنێته‌وه‌ مه‌گه‌ر دوباره‌ داخیلی بكاته‌وه‌).<br/>
3.	گۆرانكاری بڕوانامه‌ :- فه‌رمانبه‌ر میلاكت له‌م به‌شه‌دا ده‌توانێت ده‌ستكاری زانیاریه‌كانی هه‌ر بڕوانامه‌یه‌ك بكات بۆ نمونه‌ بڕوانامه‌ی سه‌ره‌تای له‌ پله‌ 10 مه‌رته‌به‌ 4 ده‌ست پێده‌كات فه‌رمانبه‌ر ده‌توانێت به‌ ئاره‌زووی خۆی بۆ هه‌ر پله‌ یان مه‌رته‌به‌یه‌كی تر بیگۆرێت(ئه‌م نمونه‌یه‌ بۆ هه‌موو بڕوانامه‌كانی تری ناو سیسته‌مه‌كه‌ راسته‌).
<br/><br/><h4 id="24">نامه‌كانی به‌كارهێنه‌ر</h4><br/>
•	له‌م به‌شه‌دا فه‌رمانبه‌ری میلاكات هه‌موو ئه‌و نامانه‌ ده‌بینێت كه‌ له‌لایه‌ن به‌كارهێنه‌رانه‌وه‌ بۆ به‌شی میلاكات نێردراوه‌ ، وه‌ بۆ هه‌ر نامه‌یه‌ك ناونیشان و به‌رواری ناردنی نامه‌كه‌ پیشان ده‌دات ، بۆ دیتنی ناوه‌رۆكی نامه‌كه‌ به‌كارهێنه‌ر ده‌توانێ كلیك له‌سه‌ر دوگمه‌ سه‌وزه‌كه‌ بكات ، وه‌ بۆ سرینه‌وه‌ی نامه‌كه‌ به‌كارهێنه‌ر ده‌توانێ كلیك له‌سه‌ر دوگمه‌ سوره‌كه‌ بكه‌ (له‌ كاتی سرینه‌وه‌ی نامه‌كه‌ فه‌رمانبه‌ر ناتوانێت دوباره‌ نامه‌كه‌ ببینێت).
<br/><br/><h4 id="25">پیشاندان و گۆرین</h4><br/>
•	ئه‌م به‌شه‌ تایبه‌ته‌ به‌ بینینی ناو و هه‌موو زانیاریه‌ گرینگه‌كانی هه‌ر فه‌رمانبه‌رێك ، له‌م به‌شه‌دا فه‌رمانبه‌ری میلاكات  ده‌توانێت هه‌ر زانیاریه‌كی تایبه‌ت به‌ هه‌ر فه‌رمانبه‌رێك ببینێت ، وه‌ ده‌توانێ ده‌ستكاری و گۆرانكاری له‌هه‌ر زانیاریه‌ك بكات ، له‌م به‌شه‌دا دووكاری گرینگ ئه‌نجام ده‌درێت به‌م شێوه‌یه‌ی خواره‌وه‌<br/>
1.	سرینه‌وه‌ی ناوی فه‌رمانبه‌ر :- به‌ كلیك كردن له‌سه‌ر دوگمه‌ سوره‌كه‌ی به‌رامبه‌ر ناوی هه‌ر فه‌رمانبه‌رێك ناوی ئه‌و فه‌رمانبه‌ره‌ له‌ لیسته‌كه‌دا ده‌سرێته‌وه‌ (ئه‌م فه‌رمانه‌ زۆر هه‌ستیاره‌ فه‌رمانبه‌ری میلاكات ته‌نها كاتێك ناوی فه‌رمانبه‌ر ده‌سرێته‌وه‌ كه‌ ئه‌و فه‌رمانبه‌ره‌ گواسترابێته‌وه‌ بۆ شوێنێكی تر یان خانه‌نشین بێت ، چونكه‌ به‌ جێبه‌جێ كردنی ئه‌م فه‌رمانه‌ هه‌موو زانیاریه‌كانی تایبه‌ت به‌م فه‌رمانبه‌ره‌ له‌ هه‌موو به‌شه‌كان ده‌سرێته‌وه‌).<br/>
2.	گۆرانكاری له‌ زانیاریه‌كان :- له‌م به‌شه‌دا ده‌تونای گۆرانكاری له‌ زانیاری هه‌ر فه‌رمانبه‌رێك بكه‌ی و پاش خه‌زن كردنی زانیاریه‌ نوێ یه‌كان ، ئه‌و زانیاریه‌ نوێیانه‌ له‌ لایه‌ن سیسته‌مه‌كه‌وه‌ به‌كاردێت.<br/>
<br/><br/>
 <img src="../../../image/13.png" alt="photo" class="center-block img-responsive" />
<br/><br/>
<h4 id="26">رێكخستنی وشه‌ی نهێنی</h4><br/><br/>
•	له‌م به‌شه‌دا له‌ دوو كار ئه‌نجام ده‌درێت ، به‌م شێوه‌ی خواره‌وه‌ :-<br/>
1.	به‌شی یه‌كه‌م : ناوی هه‌موو ئه‌و فه‌رمانبه‌رانه‌ پیشان ده‌دات كه‌ فه‌رمانبه‌ری میلاكاتن (admin) ، ئه‌م وێنه‌ی خواره‌وه‌ ئه‌م به‌شه‌ پیشان ده‌دات 
<br/><br/>
 <img src="../../../image/8.png" alt="photo" class="center-block img-responsive" />
<br/><br/>
2.	به‌شی دووه‌م : له‌م به‌شه‌دا به‌كارهێنه‌ر ده‌توانێت فه‌رمانبه‌ری ئاسایی بكاته‌ فه‌رمانبه‌ری میلاكت وه‌ فه‌رمانبه‌ری میلاكاتیش بكاته‌ فه‌رمانبه‌ری ئاسای ، ئه‌م وێنه‌ی خواره‌وه‌ ئه‌م به‌شه‌ پیشان ده‌دات 
<br/><br/>
 <img src="../../../image/9.png" alt="photo" class="center-block img-responsive" />
<br/><br/>
<br/><br/>
 <img src="../../../image/10.png" alt="photo" class="center-block img-responsive" />
<br/><br/>
<h4 >پیشان دانی فه‌رمانه‌كان</h4><br/>
•	ئه‌م به‌شه‌ تایبه‌ته‌ به‌ پیشان دانی هه‌موو ئه‌و جۆره‌ فرمانانه‌ی كه‌ بۆ فه‌رمانبه‌ر كراوه‌ (سه‌رمووچه‌ی ساڵانه‌ ، به‌رزكردنه‌وه‌،.....) ، له‌م به‌شه‌دا فه‌رمانبه‌ری میلاكات سه‌ره‌تا ده‌بێت ناوی ئه‌و فارمه‌نبه‌ره‌ هه‌ڵبژێرێت كه‌ ده‌یه‌وێـت زانیاریه‌كانی ببینێت ، پاش كلیك كردن له‌سه‌ر دوگمه‌ شینه‌كه‌ ، ئه‌و فه‌رمانبه‌ره‌ هه‌ر چ زانیاریه‌كی له‌ناو سیسته‌مه‌كه‌ هه‌بێت ، له‌لایه‌ن سیسته‌مه‌كه‌وه‌ پیشان ده‌درێت ، وێنه‌ی خواره‌وه‌ ئه‌م به‌شه‌ پیشان ده‌دات :-
<br/><br/>
 <img src="../../../image/14.png" alt="photo" class="center-block img-responsive" />
<br/><br/>
<h4 id="27">خزمه‌ت</h4><br/>
<h5 id="28">سه‌رمووچه‌ی ساڵانه‌</h5>
•	ئه‌م به‌شه‌ تایبه‌ته‌ به‌ پێدانی سه‌رمووچه‌ی ساڵانه‌ به‌ هه‌ر فه‌رمانبه‌رێكی ناو سیسته‌مه‌كه‌ ، له‌ سه‌ره‌تادا پێویسته‌ فه‌رمانبه‌ری میلاكات(admin) له‌به‌شی دیاریكردن ، یه‌كێك له‌ مانگه‌كان دیاریبكات (له‌به‌شی دیاریكردن ، فه‌رمانبه‌ری میلاكات ده‌توانێ له‌ 1 هه‌تا 12 وه‌ نوێ و كۆن هه‌ڵبژێرێ ، بۆنمونه‌ ئه‌گه‌ر ئێستا ساڵی 2017 بێت ئه‌وه‌ 1 هه‌تا 12 هه‌موو مانگه‌كانی ساڵی 2017 ده‌گه‌رێنێته‌وه‌ ، وه‌ نوێ ئه‌و سه‌رمووچانه‌ ده‌گه‌رێنته‌وه‌ كه‌ هی ساڵی دواترن بۆنمونه‌ 2018، 2019....وه‌كۆنیش ئه‌و سه‌رمووچانه‌ ده‌گه‌رێنێته‌وه‌ كه‌ ئی ساڵی پێشووترن بۆ نمونه‌ 2016، 2015)
•	پاش دیاریكردنی یه‌كێك له‌ مانگه‌كان ناوی هه‌موو ئه‌و فه‌رمانبه‌رانه‌ ده‌گه‌رێنێته‌وه‌ كه‌ له‌و مانگه‌ سه‌رمووچه‌ی ساڵانه‌یان هه‌یه‌ ، وه‌ بۆ هه‌ر فه‌رمانبه‌رێك ده‌تواندرێت ئه‌م 4 كاره‌ ئه‌نجام بدرێت ، به‌م شێوه‌ی خواره‌وه‌ :-<br/>
1.	سرینه‌وه‌ :- (دوگمه‌ سوره‌كه‌) ، ئه‌م به‌شه‌ به‌كاردێت بۆ سرینه‌وه‌ی ناوی فه‌رمانبه‌ر له‌ خشته‌ی ئه‌م مانگه‌ی سه‌رمووچه‌ی ساڵانه‌ ، به‌ڵام بۆ سرینه‌وه‌ی ناوی هه‌ر فه‌رمانبه‌رێك پێویسته‌ به‌رواری نوێی سه‌رمووچه‌ی ساڵانه‌ی ئه‌و فه‌رمانبه‌ره‌ دیاری بكه‌یت (بۆ ئه‌وه‌ی ناوی بچێته‌ لیستی مانگێكی تر)، ئه‌گه‌رنا ناتوانی ناوی له‌ لیستی ئه‌م مانگه‌ بسریته‌وه‌.<br/>
2.	گۆرانكاری :- (دوگمه‌ی شینی كاڵ) ، له‌كاتی پێدانی سه‌رمووچه‌ی ساڵانه‌ به‌ فه‌رمانبه‌ر ، كۆمه‌ڵێك زانیاری له‌لایه‌ن سیسته‌مه‌كه‌وه‌ ده‌گۆردرێت بۆ نمونه‌ مووچه‌ی فه‌رمانبه‌ر ده‌گۆردرێت و فه‌رمانبه‌ر مووچه‌ی نوێ وه‌رده‌گرێت ، بۆ ئه‌وه‌ی فه‌رمانبه‌ری میلاكات(admin) دڵنیا بێت له‌ دروستی ئه‌و گۆرانكاریانه‌ی له‌ لایه‌ن سیسته‌مه‌كه‌وه‌ كراوه‌ و ، له‌ ئه‌گه‌ری پێویستی هه‌ر گۆرانكاریه‌ك له‌م زانیاریانه‌ ، ئه‌وه‌ فه‌رمانبه‌ری میلاكات له‌م به‌شه‌ زانیاریه‌كان ده‌بینێت و ده‌توانێت گۆرانكاریان لێبكات ، له‌م به‌شه‌ دوو دوگمه‌ هه‌یه‌ ، به‌م شێوه‌ی خواره‌وه‌ :-<br/>
A.	خه‌زنكردن : - خه‌زنكردنی ئه‌و گۆرانكاریانه‌ی كه‌ له‌لایه‌ن فه‌رمانبه‌ری میلاكاته‌وه‌ كراوه‌.<br/>
B.	رێكخستنه‌وه‌ : - ئه‌م به‌شه‌ به‌كاردێت بۆ گه‌راندنه‌وه‌یی زانیاریه‌ سه‌ره‌تایه‌كان (ئه‌و زانیاریانه‌ی كه‌ له‌لایه‌ن سیسته‌مه‌كه‌وه‌ دۆزراوه‌ته‌وه‌) ، پاش ئه‌وه‌ی له‌لایه‌ن فه‌رمانبه‌ری میلاكاته‌وه‌ گۆرانكاری لێكراوه‌.<br/>
3.	گواسته‌وه‌ :-  (دوگمه‌ی شینی تۆخ ) ئه‌م به‌شه‌ تایبه‌ته‌ به‌گواسته‌وه‌ی ئه‌و فه‌رامانبه‌رانه‌ی كه‌ شایسته‌ی به‌رزكردنه‌وه‌ن و له‌به‌ر هه‌ر هۆكارێك ناویان له‌ به‌شی سه‌رمووچه‌دا هه‌یه‌.<br/>
4.	خه‌زنكردن :- (دوگمه‌ی سه‌وز) ئه‌م به‌شه‌ تایبه‌ته‌ به‌ خه‌زنكردنی سه‌رمووچه‌ی ساڵانه‌ی نوێ ، پاش خه‌زنكردن له‌لایه‌ن هه‌موو به‌شه‌كانه‌وه‌ زانیاریه‌ نوێیه‌كان به‌كاردێت ، واتا فه‌رمانبه‌ره‌كه‌ سه‌رمووچه‌ی ساڵانه‌ی وه‌رگرتووه‌ ، به‌ كلیك كردن له‌سه‌ر به‌شی خه‌زنكردن ، په‌نجه‌ره‌یه‌كی نوێ ده‌كرێته‌وه‌ ، كه‌ ده‌تواندرێت فه‌رمانه‌كانی ته‌یبه‌ت به‌ سه‌رمووچه‌ی ساڵانه‌ له‌م به‌شه‌دا داخیل بكرێت ، له‌ به‌شی داخیل كردنی فه‌رمان ، باسی ئه‌م به‌شه‌ ده‌كه‌ین.<br/>

<h5 id="29">به‌رزكردنه‌وه‌ی مووچه‌</h5>
•	ئه‌م به‌شه‌ تایبه‌ته‌ به‌ پێدانی به‌رزكردنه‌وه‌ به‌ هه‌ر فه‌رمانبه‌رێكی ناو سیسته‌مه‌كه‌ ، له‌ سه‌ره‌تادا پێویسته‌ فه‌رمانبه‌ری میلاكات له‌به‌شی دیاریكردن ، یه‌كێك له‌ مانگه‌كان دیاریبكات (له‌به‌شی دیاریكردن ، فه‌رمانبه‌ری میلاكات ده‌توانێ له‌ 1 هه‌تا 12 وه‌ نوێ و كۆن هه‌ڵبژێرێ ، بۆنمونه‌ ئه‌گه‌ر ئێستا ساڵی 2017 بێت ئه‌وه‌ 1 هه‌تا 12 هه‌موو مانگه‌كانی ساڵی 2017 ده‌گه‌رێنێته‌وه‌ ، وه‌ نوێ ئه‌و به‌رزكردنه‌وانه‌ ده‌گه‌رێنته‌وه‌ كه‌ هی ساڵی دواترن بۆنمونه‌ 2018، 2019....وه‌كۆنیش ئه‌و به‌رزكردنه‌وانه‌ ده‌گه‌رێنێته‌وه‌ كه‌ ئی ساڵی پێشووترن بۆ نمونه‌ 2016، 2015)
•	پاش دیاریكردنی یه‌كێك له‌ مانگه‌كان ناوی هه‌موو ئه‌و فه‌رمانبه‌رانه‌ ده‌گه‌رێنێته‌وه‌ كه‌ له‌و مانگه‌ به‌رزكردنه‌وه‌یان  هه‌یه‌ ، وه‌ بۆ هه‌ر فه‌رمانبه‌رێك ده‌تواندرێت ئه‌م 4 كاره‌ ئه‌نجام بدرێت ، به‌م شێوه‌ی خواره‌وه‌ :-<br/>
1.	سرینه‌وه‌ :- (دوگمه‌ سوره‌كه‌) ، ئه‌م به‌شه‌ به‌كاردێت بۆ سرینه‌وه‌ی ناوی فه‌رمانبه‌ر له‌ خشته‌ی ئه‌م مانگه‌ی به‌رزكردنه‌وه‌ ، به‌ڵام بۆ سرینه‌وه‌ی ناوی هه‌ر فه‌رمانبه‌رێك پێویسته‌ به‌رواری نوێی سه‌رمووچه‌ی ساڵانه‌ی ئه‌و فه‌رمانبه‌ره‌ دیاری بكه‌یت (بۆ ئه‌وه‌ی ناوی بچێته‌ لیستی مانگێكی تر)، ئه‌گه‌رنا ناتوانی ناوی له‌ لیستی ئه‌م مانگه‌ بسریته‌وه‌.<br/>
2.	گۆرانكاری :- (دوگمه‌ی شینی كاڵ) ، له‌كاتی پێدانی به‌رزكردنه‌وه‌ به‌ فه‌رمانبه‌ر ، كۆمه‌ڵێك زانیاری له‌لایه‌ن سیسته‌مه‌كه‌وه‌ ده‌گۆردرێت بۆ نمونه‌ مووچه‌ی فه‌رمانبه‌ر ده‌گۆردرێت و فه‌رمانبه‌ر مووچه‌ی نوێ وه‌رده‌گرێت ، بۆ ئه‌وه‌ی فه‌رمانبه‌ر دڵنیا بێت له‌ دروستی ئه‌و گۆرانكاریانه‌ی له‌ لایه‌ن سیسته‌مه‌كه‌وه‌ كراوه‌ و ، له‌ ئه‌گه‌ری پێویستی هه‌ر گۆرانكاریه‌ك له‌م زانیاریانه‌ ، ئه‌وه‌ فه‌رمانبه‌ری میلاكات(admin) له‌م به‌شه‌ زانیاریه‌كان ده‌بینێت و ده‌توانێت گۆرانكاریان لێبكات ، له‌م به‌شه‌ دوو دوگمه‌ هه‌یه‌ ، به‌م شێوه‌ی خواره‌وه‌ :-<br/>
A	خه‌زنكردن : - خه‌زنكردنی ئه‌و گۆرانكاریانه‌ی كه‌ له‌لایه‌ن فه‌رمانبه‌ری میلاكاته‌وه‌ كراوه‌.<br/>
B	رێكخستنه‌وه‌ : - ئه‌م به‌شه‌ به‌كاردێت بۆ گه‌راندنه‌وه‌یی زانیاریه‌ سه‌ره‌تایه‌كان (ئه‌و زانیاریانه‌ی كه‌ له‌لایه‌ن سیسته‌مه‌كه‌وه‌ دۆزراوه‌ته‌وه‌) ، پاش ئه‌وه‌ی له‌لایه‌ن فه‌رمانبه‌ری میلاكاته‌وه‌ گۆرانكاری لێكراوه‌.<br/>
3.	گواسته‌وه‌ :-  (دوگمه‌ی شینی تۆخ ) ئه‌م به‌شه‌ تایبه‌ته‌ به‌گواسته‌وه‌ی ئه‌و فه‌رامانبه‌رانه‌ی كه‌ شایسته‌ی سه‌رمووچه‌ی ساڵانه‌ن و له‌به‌ر هه‌ر هۆكارێك ناویان له‌ به‌شی به‌رزكردنه‌وه‌ هه‌یه‌.<br/>
4.	خه‌زنكردن :- (دوگمه‌ی سه‌وز) ئه‌م به‌شه‌ تایبه‌ته‌ به‌ خه‌زنكردنی به‌رزكردنه‌وه‌ی نوێ ، پاش خه‌زنكردن له‌لایه‌ن هه‌موو به‌شه‌كانه‌وه‌ زانیاریه‌ نوێیه‌كان به‌كاردێت ، واتا فه‌رمانبه‌ره‌كه‌ به‌رزكردنه‌وه‌ی وه‌رگرتووه‌ ، به‌ كلیك كردن له‌سه‌ر به‌شی خه‌زنكردن ، په‌نجه‌ره‌یه‌كی نوێ ده‌كرێته‌وه‌ ، كه‌ ده‌تواندرێت فه‌رمانه‌كانی ته‌یبه‌ت به‌ به‌رزكردنه‌و له‌م به‌شه‌دا داخیل بكرێت ، له‌ به‌شی داخیل كردنی فه‌رمان ، باسی ئه‌م به‌شه‌ ده‌كه‌ین.<br/>

<h5 id="30">هه‌ژماری راژه‌</h5><br/>
•	ئه‌م به‌شه‌ تایبه‌ته‌ به‌پێدانی هه‌ژماری راژه‌ به‌ فارمانبه‌ر ، سه‌ره‌تا پێویسته‌ ناوی ئه‌و فه‌رمانبه‌ره‌ دیاری بكه‌ین كه‌ ده‌مانه‌وێت هه‌ژماری راژه‌ی بۆ بكه‌ین ، پاشان زانیاریه‌كانی تایبه‌ت به‌ هه‌ژماری راژه‌ داخیل ده‌كرێت (سیسته‌مه‌كه‌ هیچ زانیاریه‌ك ناگه‌رێنێته‌وه‌ چونكه‌ هه‌ژماری راژه‌ ، له‌لایه‌ن وه‌زاره‌تی دارایه‌وه‌ هه‌ژمار ده‌كرێت ، سیسته‌مه‌كه‌ به‌س زانیاریه‌كانی وه‌زاره‌تی دارایی خه‌زن ده‌كات) ، پاشان په‌نجه‌ره‌ی فه‌رمانه‌كان ده‌كرێته‌وه‌ (له‌به‌شی داخیلكردنی فه‌رمان باسی ده‌كه‌ین).<br/>
<h5 id="31">پێشخستن</h5><br/>
•	ئه‌م به‌شه‌ تایبه‌ته‌ به‌ پێدانی پێشخستنی سوپاس و پێزانین به‌ فه‌رمانبه‌ر ، پێویسته‌ فه‌رمانبه‌ری میلاكات ئاگاداری ئه‌م خاڵانه‌ بێت له‌ كاتی پێدانی پێشخستنی سوپاس و پێزانین<br/>
1.	ئه‌و فه‌رمانبه‌رانه‌ی كه‌ مۆڵه‌تیان هه‌یه‌ ناتواندرێت پێشخستنی سوپاس و پێزانینیان بدرێتێ.<br/>
2.	هه‌ر فه‌رمانبه‌رێك بۆی هه‌یه‌ له‌یه‌ك ساڵدا سێ جار پێشخستنی سوپاس و پێزانینی بدرێتێ<br/>
3.	ده‌تواندرێت چه‌ند فه‌رمانبه‌رێك به‌یه‌كه‌وه‌ پێشخستنیان بدرێتێ<br/>
4.	ده‌كرێ ئه‌م پێشخستنی سوپاس و پێزانینه‌ كاریگه‌ری له‌سه‌ر سه‌رمووچه‌ی ساڵانه‌ هه‌بێت وه‌ ده‌كرێ كاریگه‌ری نه‌بێت ، ئه‌گه‌ر كاریگه‌ری هه‌بێت سه‌رمووچه‌ی ساڵانه‌ یه‌ك مانگ ده‌هێنێته‌ پێش.<br/>
5.	ئه‌گه‌ر فه‌رمانبه‌ره‌كه‌ سێ یان زیاتر ، پێشخستنی سوپاس و پێزانینی هه‌بێت ئه‌وا ناتواندرێت پێشخستنی تری بدرێتێ (سیسته‌مه‌كه‌ بۆی حیساب ناكات).<br/>
•	له‌م به‌شه‌دا ده‌تواندرێت دوو كار ڵه‌گه‌ڵ زانیاریه‌كان بكرێت ، به‌م شێوه‌ی خواره‌وه‌ :-<br/>
1.	سرینه‌وه‌ :- له‌م به‌شه‌ ناوی ئه‌م فه‌رمانبه‌ره‌ ره‌شده‌كاته‌وه‌ كه‌ ویستمان پێشخستنی سوپاس و پێزانین بدرێتی (هیچ گۆرانكاریه‌ك له‌ زانیاریه‌كان ناكرێت ، وپێشخستنی سوپاس و پێزانینیش وه‌رناگرێ).<br/>
2.	خه‌زنكردن :- له‌م به‌شه‌دا پێشخستنی سوپاس و پێزانه‌كه‌ خه‌زن ده‌بێت ، پاش كلیك كردن له‌سه‌ر دوگمه‌ سه‌وزه‌كه‌ ، په‌نجه‌ره‌یه‌ك ده‌بێته‌وه‌ كه‌ داوا كه‌ فه‌رمانبه‌ری میلاكات ده‌كات كه‌ ئه‌م پێشخستنه‌ به‌رواری سه‌رمووچه‌ی ساڵانه‌ بهێنێته‌ پێش یاخود نا ، پاش كلیك كردن له‌سه‌ر دوگمه‌ی ئه‌و په‌نجه‌ره‌یه‌ش به‌شێكی نوێ ده‌بته‌وه‌ بۆخه‌زنكردنی پێشخستنی سوپاس و پێزانینه‌كه‌ له‌ناو سیسته‌مه‌كه‌ وه‌ هه‌ر له‌م به‌شه‌ فه‌رمانبه‌ری میلاكات ده‌توانێت زانیاری ده‌رباره‌ی فه‌رمانه‌كه‌ خه‌زن بكات (له‌به‌شی داخیل كردنی فه‌رمان باسی ده‌كه‌ین).<br/>
•	ئه‌م وێنانه‌ی خواره‌وه‌ به‌شی پێشخستنی سوپاس و پێزانین پیشان ده‌ده‌ن :-<br/>
•	به‌شی سه‌رمووچه‌ی ساڵانه
<br/><br/>
 <img src="../../../image/14.png" alt="photo" class="center-block img-responsive" />
<br/><br/>
•	ئه‌م په‌نجه‌ره‌یه‌ به‌كاردێت بۆ دیاریكردنی ئه‌وه‌ی كه‌ پێشخستنی سوپاس و پێزانینه‌كه‌ كاریگه‌ری له‌سه‌رسه‌رمووچه‌ی ساڵانه‌ هه‌بێت یا نا. 
<br/><br/>
 <img src="../../../image/14.png" alt="photo" class="center-block img-responsive" />
<br/><br/>
•	ئه‌م به‌شه‌ له‌ داخیلكردنی فه‌رمانه‌كان باسده‌كرێت 
<br/><br/>
 <img src="../../../image/14.png" alt="photo" class="center-block img-responsive" />
<br/><br/>
<h4 id="32">بڕوانامه‌</h4><br/>
•	ئه‌م به‌شه‌ تایبه‌ته‌ به‌ بڕوانامه‌ ، ئه‌م به‌شه‌ كاتێك به‌كاردێت كه‌ فه‌رمانبه‌ر بڕوانامه‌ی نوێ به‌ده‌ست ده‌هێنێت ، پێویسته‌ فه‌رمانبه‌ری میلاكات ره‌چاوی ئه‌م خاڵانه‌ بكات له‌كاتی كاركردن له‌م به‌شه‌دا :-<br/>
1.	ئه‌و فه‌رمانبه‌رانه‌ی كه‌ مۆڵه‌تیان هه‌یه‌ ناتوانێت بڕوانامه‌ی نوێی پێ بده‌ی<br/>
2.	ئه‌گه‌ر بڕوانامه‌ی ئێستای فه‌رمانبه‌ر گه‌وره‌تربوو له‌و بڕوانامه‌ی كه‌ فه‌رمانبه‌ری میلاكات ده‌یه‌وێ بیداته‌ فه‌رمانبه‌ر ، ئه‌وا سیسته‌مه‌كه‌ هیچ كارێك ناكات.<br/>
3.	فه‌رمانبه‌ری میلاكت ته‌نها ده‌توانێت ئه‌و بڕوانامانه‌ به‌كاربهێنێ كه‌ له‌به‌شی رێكخستنی بڕوانامه‌دا هه‌یه‌ (ئه‌م به‌شه‌ به‌شێكه‌ له‌به‌شی رێكخستن)، واتا ئه‌گه‌ر <br/>فه‌رمانبه‌ری میلاكات ویستی بڕوانامه‌یه‌ك بدات كه‌ له‌ سیسته‌مه‌كه‌ نه‌بێت ، ئه‌وا پێویسته‌ یه‌كه‌م جار له‌به‌شی رێكخستنی بڕوانامه‌ ، ئه‌و بڕوانامه‌ نوێ یه‌ زیاد بكات ، ئینجا ده‌توانێ به‌كاریبهێنێ.<br/>
•	بۆ پێدانی بڕوانامه‌ به‌ فه‌رمانبه‌ر ، پێویسته‌ سه‌ره‌تا ناوی فه‌رمانبه‌ر و ئه‌و بڕوانامه‌یه‌ دیاری بكه‌یت كه‌ ده‌ته‌وێ بیده‌یته‌ فه‌رمانبه‌ر ، ئه‌گه‌ر زانیاریه‌كانت ته‌واو بێت ئه‌وا سیسته‌مه‌كه‌ هه‌ژماری زانیاریه‌كان ده‌كات و زانیاریه‌ نوێ یه‌كان ، بۆ فه‌رمانبه‌ری میلاكات ده‌گه‌رێنێته‌وه‌ (به‌ڵام خه‌زن ناكات ده‌بێت فه‌رمانبه‌ری میلاكات خۆی خه‌زنی بكات).<br/>
•	له‌كاتی هێنانه‌وه‌ی زانیاریه‌كان بۆ هه‌ر فه‌رمانبه‌رێك ده‌تواندرێت سێ كار ڵه‌گه‌ڵ زانیاریه‌كان بكات به‌م شێوه‌ی خواره‌وه‌ :-<br/>
1.	سرینه‌وه‌ ناوی فه‌رمانبه‌ر  :- به‌ كلیك كردن له‌سه‌ر دوگمه‌ سوره‌كه‌ ناوی ئه‌و فه‌رمانبه‌ره‌ ده‌سرێته‌وه‌ كه‌ پێشتر ویستمان بڕوانامه‌ی نوێی پێ بده‌ین(هیچ گۆرانكاریه‌ك له‌ سیسته‌مه‌كه‌ روونادات).<br/>
2.	گۆرانكاری له‌ زانیاریه‌كان :- به‌ كلیك كردن له‌سه‌ر دوگمه‌ شینه‌كه‌ (شینی كاڵ) ، فه‌رمانبه‌ری میلاكات ده‌توانێت ئه‌و زانیاریانه‌ بگۆرێت كه‌ له‌لایه‌ن سیستمه‌كه‌وه‌ دۆزراوه‌ته‌وه‌ ، پاش كلیك كردن په‌نجه‌ره‌یه‌ك ده‌بێته‌وه‌و كه‌ هه‌موو ئه‌و گۆرانكاریانه‌ی تێدایه‌ كه‌ به‌سه‌ر زانیاریه‌كان دادێت وه‌ له‌م به‌شه‌ش دوو دوگمه‌ هه‌یه‌ به‌م شێوه‌ی خواره‌وه‌ :-<br/>
A.	رێكخستنه‌وه‌ : ئه‌م دوگمه‌یه‌ی كاتێك به‌كاردێت كه‌ زانیاریه‌كان له‌لایه‌ن فه‌رمانبه‌ری میلاكاته‌وه‌ گۆرانكاری له‌سه‌ر كراوه‌ ، پاش ئه‌م گۆرانكاریه‌ فه‌رمانبه‌ری میلاكات هه‌ست ده‌كات زانیاریه‌كانی سیسته‌مه‌كه‌ راست بووه‌ و زانیاریه‌كانی ئه‌و هه‌ڵه‌بووه‌ به‌مه‌به‌ستی گه‌رانه‌وه‌ی زانیاریه‌كان بۆ شێوه‌ی یه‌كه‌م جاری ئه‌م دوگمه‌یه‌ به‌كاردێت<br/>
B.	خه‌زنكردن :- ئه‌م دوگمه‌یه‌ به‌كاردێت بۆ خه‌زن كردنی زانیاریه‌كان پاش هه‌ر گۆرانكاریه‌ك<br/>
3.	خه‌زنكردن(ئه‌وه‌ خه‌زنكردنه‌ جیاوازه‌ ڵه‌گه‌ڵ خه‌زنكردنی خاڵی 2 م لقی B ، ئه‌وه‌ تایبه‌ته‌ به‌خه‌زنكردنی بڕوانامه‌ی نوێ ، به‌ڵام خاڵی 2 م لقی B  كاتێك به‌كاردێت كه‌ گۆرانكاریه‌ك له‌ زانیاریه‌كان بكه‌ی) :-  ئه‌م به‌شه‌ به‌كاردێت بۆ خه‌زنكردنی بڕوانامه‌ نوێیه‌كه‌ (بۆنمونه‌ ئه‌گه‌ر فه‌رمانبه‌رێك بڕوانامه‌ی ماسته‌ری هه‌بێت كاتێك له‌م به‌شه‌ بڕوانامه‌ی دكتۆرای پێ ده‌ده‌ین ، پاش خه‌زن كردن له‌ هه‌موو به‌شه‌كان بڕوانه‌مه‌ی ئه‌و فه‌رمانبه‌ره‌ ده‌گۆرێت بۆ دكتۆرا وه‌ پله‌ و مه‌رته‌به‌ی دكۆرا وه‌رده‌گرێ ئه‌گه‌ر پله‌و مه‌رته‌به‌ی خۆی نزم تربێت له‌هی دكتۆرا ئه‌گه‌رنا پێشخستن وه‌رده‌گرێت) ، پاش كلیك كردن له‌سه‌ر دوگمه‌ سه‌وزه‌كه‌ په‌نجه‌ره‌یه‌كی نوێ ده‌بته‌وه‌ ، وێنه‌ی خواره‌وه‌ ئه‌م په‌نجه‌ره‌یه‌ پیشان ده‌دات .
<br/><br/>
 <img src="../../../image/14.png" alt="photo" class="center-block img-responsive" />
<br/><br/>
•	پاش كلیك كردن له‌سه‌ر خه‌زن بڕوانامه‌ نوێیه‌كه‌ خه‌زن ده‌بێت ، ئه‌م په‌نجه‌ره‌یه‌ له‌ زۆربه‌ی به‌شه‌كانی دیكه‌ش دوباره‌ ده‌بێته‌وه‌ بۆیه‌ له‌به‌شی داخیلكردنی فه‌رمان باسی ئیش و كاری ئه‌م په‌نجه‌ره‌یه‌ ده‌كه‌ین.<br/>
•	وێنه‌ی خواره‌وه‌ به‌شی بڕوانامه‌ پیشان ده‌دات
<br/><br/>
 <img src="../../../image/14.png" alt="photo" class="center-block img-responsive" />
<br/><br/>
<h4 id="33">مۆڵه‌ت</h4><br/>
•	ئه‌م به‌شه‌ تایبه‌ته‌ به‌ پێدانی مۆله‌تی بێ مووچه‌ به‌ فه‌رمانبه‌ر ، له‌م به‌شه‌دا فه‌رمانبه‌ری میلاكات ده‌توانێ ناوی هه‌موو ئه‌و فه‌رمانبه‌رانه‌ ببینێ كه‌ مۆڵه‌تی بێ مووچه‌یان هه‌یه‌ ڵه‌گه‌ڵ ماوه‌ی مۆڵه‌ته‌كه‌ی و به‌رواری ده‌ست پێكردنی مۆڵه‌ته‌كه‌ی و به‌رواری كۆتای هاتنی مۆڵه‌ته‌كه‌ی(تێبینی :-  له‌كاتی بوونی مۆڵه‌ت ناتواندرێت هیچ جۆره‌ فرمانێك بۆ فه‌رمانبه‌ر جێبه‌جێ بكرێـت ) ، وه‌ له‌م به‌شه‌دا سێ كاری گرینگ ده‌كرێت ، به‌م شێوه‌یه‌ی خواره‌وه‌ :-<br/>
1.	سرینه‌وه‌ی مۆڵه‌ت : به‌ كلیك كردن له‌سه‌ر دوگمه‌ سوره‌كه‌ ده‌تواندرێت مۆڵه‌تی ئه‌و فه‌رمانبه‌ره‌ هه‌ڵبوه‌شێندرێته‌وه‌ ، وه‌ له‌كاتی سرینه‌وه‌ی مۆڵه‌ت سیسته‌مه‌كه‌ داوا له‌ فه‌رمانبه‌ری میلاكات ده‌كات كه‌ به‌رواری نوێی سه‌رمووچه‌ی ساڵانه‌ی ئه‌و فه‌رمانبه‌ره‌ داخیل بكات كه‌ مۆڵه‌ته‌كه‌ی ده‌سرێته‌وه‌.<br/>
2.	گۆرانكاری ماوه‌ی مۆڵه‌ت :- به‌ كلیك كردن له‌سه‌ر دوگمه‌ سه‌وزه‌كه‌ ده‌تواندرێت گۆرانكاری له‌ ماوه‌ی مۆڵه‌تی ئه‌و فه‌رمانبه‌ره‌ بكرێت(بۆ نمونه‌ مۆڵه‌ته‌كه‌ ساڵێكه‌ ده‌مانه‌وێت بیكه‌ینه‌ دوو ساڵ) ، به‌ كلیك كردن سیسته‌مه‌كه‌ داوا له‌ فه‌رمانبه‌ری میلاكات ده‌كات ماوه‌ی مۆڵه‌ته‌كه‌ به‌ ساڵ و مانگ و رۆژ دیاری بكه‌(بۆنمونه‌ ئه‌گه‌ر ماوه‌ی مۆڵه‌ت 6 مانگ بێت پێویسته‌ له‌به‌شی مانگ 6 بنوسرێت وه‌ له‌به‌شی ساڵ و رۆژیش 0 بنوسرێـت) ، پاش داخیل كردنی ئه‌م زانیاریانه‌ سیسته‌مه‌كه‌ ماوه‌ی ده‌ست پێكردن و كۆتای مۆڵه‌ته‌كه‌ دیاری ده‌كات ، ئه‌گه‌ر فه‌رمانبه‌ری میلاكت به‌هه‌ر هۆكارێك رازی نه‌بوو به‌و ئه‌نجامه‌ی كه‌ له‌لایه‌ن سیسته‌مه‌كه‌وه‌ دۆزراوه‌ته‌وه‌ ، ئه‌وا ده‌توانێ گۆرانكاری له‌ ئه‌نجامه‌كه‌ بكات و پاشان خه‌زنی بكات.<br/>
3.	مۆڵه‌تی نوێ :- به‌كلیك كردن له‌سه‌ر دوگمه‌ شینه‌كه‌ فه‌رمانبه‌ری میلاكات ده‌توانێ ناوی فه‌رمانبه‌ری نوێ زیادبكات بۆ خشته‌ی مۆڵه‌ت (واتا مۆڵه‌تیان بداتێ)، پاش دیاریكردنی ناوی ئه‌و فه‌رمانبه‌ره‌ی كه‌ ده‌مانه‌وێ مۆڵه‌تی پێ بده‌ین ، سیسته‌مه‌كه‌ داوای ماوه‌ی مۆڵه‌ته‌ ، سیسته‌مه‌كه‌ داوا له‌ فه‌رمانبه‌ری میلاكات ده‌كات ماوه‌ی مۆڵه‌ته‌كه‌ به‌ ساڵ و مانگ و رۆژ دیاری بكه‌(بۆنمونه‌ ئه‌گه‌ر ماوه‌ی مۆڵه‌ت 6 مانگ بێت پێویسته‌ له‌به‌شی مانگ 6 بنوسرێت وه‌ له‌به‌شی ساڵ و رۆژیش 0 بنوسرێـت) ، پاش داخیل كردنی ئه‌م زانیاریانه‌ سیسته‌مه‌كه‌ ماوه‌ی ده‌ست پێكردن و كۆتای مۆڵه‌ته‌كه‌ دیاری ده‌كات ، ئه‌گه‌ر فه‌رمانبه‌ری میلاكت به‌هه‌ر هۆكارێك رازی نه‌بوو به‌و ئه‌نجامه‌ی كه‌ له‌لایه‌ن سیسته‌مه‌كه‌وه‌ دۆزراوه‌ته‌وه‌ ، ئه‌وا ده‌توانێ گۆرانكاری له‌ ئه‌نجامه‌كه‌ بكات و پاشان خه‌زنی بكات(هه‌نگاوه‌كان وه‌كو خاڵی دووه‌مه‌).<br/>
•	ئه‌م وێنه‌ی خواره‌وه‌ به‌شی مۆڵه‌ت پیشان ده‌دات :-
<br/><br/>
 <img src="../../../image/15.png" alt="photo" class="center-block img-responsive" />
<br/><br/>
<h4 id="34">داخیلكردنی فه‌رمان</h4><br/>

</p>

	</div>
</div>
</div>
</div>
</body>
</html>