<!DOCTYPE html>
<html lang="en">
<head>
  <title>نامیلکە</title>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  
	<link rel="stylesheet" type="text/css" href="../../../CSS/design_milakat_1.css">
	<link href="../../../need/magicsuggest/magicsuggest.css" rel="stylesheet">
	<link rel="stylesheet" type="text/css" 		 href="../../../need/DataTables/media/css/jquery.dataTables.css"> 
	<script src="../../../need/jquery/jquery-1.12.0.js"></script>
	<style type="text/css">
   .text2 a:hover  {
                background:#337ab7;
               color: white !important;
                text-decoration: none !important;
               
            }
  .textdeco{
            	    text-decoration: none !important;

            }
  
  .text2 a:focus  {
                background:#337ab7 !important;
                color: white !important;
                 text-decoration: none !important;
            }
    .text2 a
    { 
    	color:#9d9d9d !important;
    	font-size: 13px !important;
        word-spacing: 2px !important;

    }
    .text
    { 
    	color: white !important;
    	font-size: 16px !important;
        word-spacing: 2px !important;
    }
    h4,h2,h5{
    	color: #383838 !important;
    	font-weight: bold !important;
    }
  </style>
</head>
<body class="color " >
<?php 
	include("header_ar_hr.php");
?>

<div class="container">

	<div class="row">
<div class="col-lg-2 col-md-2 col-sm-3 ">
	<div class="text2 textdeco" >
	<br/><br/>
<h4></h4><br/>	
<a  href="#1" >المقدمة     </a><br/><br/>
<a  href="#2">الجزء الاول : تسجيل الدخول </a><br/><br/>
<a  href="#3">سجيل الدخول                              <br/></a><br/>
<a  href="#4">استلام اسم المستخدم و كلمة السر          <br/>	</a><br/>
<a  href="#5">الاول تسجيل  دخول 	                       <br/>	</a><br/>
<a  href="#6">حماية من معلومات الخاطئة  	     <br/>	</a><br/>
<a  href="#7">تغير كلمة السر                         <br/>	</a><br/>
<a  href="#8">نسيان كلمة سر              <br/>	</a><br/>
<a  href="#9">نسيان اسم المستخدم            <br/>	</a><br/>
<a  href="#10">نوعية المستخدم                            <br/>	</a><br/>
<a  href="#11">قسم الاستعمال الاعتيادي	                     <br/>	</a><br/>
<a  href="#12">معلومات شخصية 	                                <br/>	</a><br/>
<a  href="#13">جدول الراتب	                                 <br/>	</a><br/>
<a  href="#14">قسم الخدمة                                    <br/>	</a><br/>
<a  href="#15">اللغة	                                         <br/>	</a><br/>
<a  href="#16">رقم السري                                 <br/>	</a><br/>
<a  href="#17">الاتصال بنا                         <br/>	</a><br/>
<a  href="#18">تسجيل الخروج                                 <br/>	</a><br/>
<a  href="#19">به‌شی میلاكت (HR)	                             <br/>	</a><br/>
<a  href="#20">زيادة الموظف الجديد                    <br/>	</a><br/>
<a  href="#21">ترتيب	                                     <br/>	</a><br/>

</div>
	</div>

<br><br>
	<div class="col-lg-10 col-md-10 col-sm-9 ">
	<div class="text">
		<p>
			<h4 id="1">المقدمة</h4><br>
تم تنظيم هذا الرنامج لقسم ميلاكات كلية الهندسة جامعة صلاح الدين في اربيل من قيبل طلاب مرحلة الرابعة قسم السوفتوير , وهذا هو قسم من مشروع مرحلة الرابعة . وهذا البرنامج يعمل عن طريق الانترنيت لتسير عمل الامور المرتبطة بقسم الميلاكات  , و هذا البرنامج يتكون من قسمين رئيسين  , القسم الاول خاص بموظفين الاعتيادين  , هذا النوع  ( هذا القسم يستطيعون الموظفين يستطيعون رؤية معلوماتهم الشخصية فقط , ولا يستطيعون رؤية اي امر داخل النظام ( في اسفل الاقسام نتكلم عنه بتفصيل )
قسم الثاني خاص بموظفين قسم  الميلاكات هذا القسم خاص لنتفيذ عمل و امور قسم الميلاكات ( في الاسفل الاقسام نتكلم عنه بتفصيل ) 
هذا النظام مصنوع من ثلاث لغات الكوردية و العربية و الانكليزية  و بامكان المستخدم من اسخدام اي لغة 

<br/><br/><h4 id="2">قسم الاول : تسجيل الدخول</h4><br/>
هذا النظام يعمل عن طريق الانترنيت و بامكان الموظف دخول الى النظام في حال استخدام ( الكومبيوتر , الموبايل ..... ) في حال الاتصال بالانترنيت ، في هذا النظام كيفية تسجيل الدخول المستخدم  ، و حماية المعلومات الشخصية من ( هاكر )  ، من اهم الاقسام هذا النظام ، لذلك بافضل الانواع حماية المستخدم من اي حادث غير مرغوب به


<br/><br/><h4 id="3">تسجيل الدخول </h4><br>
اي مستخدم يريد الدخول الى النظام يجب ان يمتلك اسم المستخدم و كلمة المرور ، بعد تسجيل الدخول هذا المعلومات من قيبل المستخدم في قسم التسجيل الدخول 
يستطيع المستخدم دخول الى النظام ان كان اسمه مسجل في النظام من قبل و الا  فان النظام لا يسمح لة بتسجيل الدخول

<br/><br/><h4 id="4">استلام اسم المستخدم و كلمة المرور </h4><br/>
هذا النظام ليس بنظام عام ، و ليس بمقدور اي شخص دخول الى النظام و رؤية المعلومات باستثناء موظفي كلية الهندسة جامعة صلاح الدين و قد قامو من قبل بتسجيل دخولهم ، لحصول على اسم الامستخدم و كلمة المرور يجب زيارة قسم الملاكات كلية الهندسة ( في قسم الميلاكات نتحدث كن كيفية تصنيع اسم المستخدم و كلمة المرور )

<br/><br/><h4 id="5">أول : تسجيل دخول ‌</h4><br/>
عند الدخول للاول مرة من قبيل المستخدم يطلب منك النظام بتغير اسم مستخدم و كلمة المرور  و هذا التغير مهم جدا لحماية المستخدم  لان اسم المستخدم و كلمة المرور استلمه من قيبل قسم الملاكات ( معلومات مرئية و غير خاصة بمستخدم ، الموظف يستطيع رؤية الاقسام الاخرى في قسم الموظفين الاعتيادين ) 
حتى اذا لم يقم المستخدم من تغير كلمة السر و اسم المستخدم  فان النظام يطلب منه تغير كلمة السر و اسم المستخدم مرة اخرى الى حين تغير اسم المستخدم و كلمة السر

<br/><br/><h4 id="6">الحماية من المعلومات الخاطئة </h4><br/>
مهم جدا في اي قسم داخل النظام استخدام معلومات صحيحة من قبيل المستخدم لكي يقوم النظام بعمل بافضل نوعية و بدون مشاكل ، لذلك في قسم تسجيل الدخول وجود عدة قوانين و على المستخدم التقيد بها في حال تسجيل الدخول الى النظام ، ( مثال لا يجب ان يتكون كلمة المرور عن اكثر من 8 ارقام او احرف و لا يجب ان يحتوي اسم الامستخدم من ارقام ، و في حال وجود هذه الاخطاء فان النظام  ينبه المستخدم من ذلك بان المعلومات غير صحيحة .
و في الصورتين في الاسفل رؤية اختلاف بين المعلومات الصحيحة و الخاطئة .
<br/><br/>
 <img src="../../../image/1.png" alt="photo" class="center-block img-responsive" />
 <br/><br/>
 <img src="../../../image/2.png" alt="photo" class="center-block img-responsive" />
<br/><br/>
<h4 id="7">تغير كلمة السر </h4><br/>
باستثناء تسجيل دخول الاول ( تكلمنا عنه في الاعلى ) فان المستخدم يستطيع تغير اسم المستخدم و كلمة المرور الخاص به  في اي وقت ، و لا يجب لمستخدمين امتلاك نفس اسم المستخدم ( مثال لا يمكن لمستخدم نياز او اي اسم اخر يخزن به ) في حال وجود هذا المشكلة فان النظام يقوم بانذار المستخدم بان اسم المستخدم خطأ
<br/><br/><h4 id="8">نسيان كلمة السر </h4>
<h4 id="9">نسيان اسم المستخدم </h4><br/>
<h4 id="10">نوعية المستخدم </h4><br/>
وجود نوعين من المستخدمين في هذا النظام 
  1_ المستخدم الاعتيادي : في هذا النوع فان المستخدم يستطيع من رؤية معلوماته الشخصية فقط و لا يستطيع التلاعب بأي شيء اخر 
2_ موظف الميلاكات : هذا النوع من الموظفين يستطيعون رؤية معلومات جميع الموظفين داخل النظام و يستطيعونة فعل اي تغير داخل النظام 
في قسم الميلاكات نقوم بشرح كيفية انتخاب الموظف الاعتيادي و الموظف ميلاكات 

<br/><h3 id="11">قسم المستخدم الاعتيادي </h3><br/>
<br/><h4 id="12">معلومات الشخصية </h4><br/>
في هذا القسم يتم رؤية اهم المعلومات الشخصية لمستخدم 
<br/><br/><h4 id="13">جدول الراتب</h4><br/>
هذا القسم خاص يتم رؤية الجداول المستخدمة من قيبل حكومة اقليم كوردستان حاليا ، يستخدم لغرض توزيع رواتب الموظفين ، المستخدم يستطيع رؤية راتبه المقبلة او اي معلومة اخرى في هذا الجدول
<br/><br/><h4 id="14">قسم الخدمة</h4><br/>
هذا القسم خاص لرؤية جميع التغيرات التي حصلة عليها الموظف خلال خدمته 
و يتكون من عدة اقسام ، في مقدمة اي قسم يتم فتح اهم المعلومات اذا ارادة المستخدم فتحه ويستطيع رؤية ملحق المعلومات الاخرى بضغطة  كليك على الموجود اسفل اي قسم 
<br/><br/>
<img src="../../../image/3.png" alt="photo" class="center-block img-responsive" />
<br/><br/>
ويتكون هذه الاقسام  من : 
1_  حساب الخدمة 
2_  تقديم شكر و التقدير 
3_  تقديم الشهادة 
4_  الترفيع
5_ العلاوة السنوية
<br/><br/><h5 id="15">لغة </h5><br/>
في هذا القسم بامكان الموظف اختيار اللغة التي يرغب بها
<br/><br/><h5 id="16">كلمة السر </h5><br/>
في هذا القسم يستطيع الموظف من تغير اسم المستخدم و كلمة المرور ( تحدثنا عنها في قسم تسجيل الدخول ) 
<br/><br/><h5 id="17">الاتصال بنا</h5><br/>
في حال وجود اي مشكلة في معلومات الموظف او وجود اي استفسار او وجود طلب بامكان الموظف في هذا القسم الاتصال بموظف الميلاكات و يقدم طلبه 
<br/><br/><h5 id="18">تسجيل الخروج</h5><br/>
في هذا القسم يستطيع المستخدم  خروج من النظام , و لدخول مرة اخرى داخل النظام على المستخدم من تسجيل  اسم المستخدم و كلمة المرور داخل النظام 
<br/><br/><h2 id="19">قسم الميلاكات</h2><br/>
<br/><h4 id="20">زيادة موظف جديد</h4><br/>
هذا القسم خاص لزيادة موظف جديد داخل النظام ،يجب على موظف الميلاكات في هذا القسم من ادخال  معلومات الخاصة لموظف الجديد ، و يتكون  المعلومات  من قسمين ، يجب ادخال قسم ، في حال عدم وجود هذه المعلومات فان النظام لايستطيع زيادة اسم موظف الجديد ، و القسم الاخر من المعلومات حتى اذا لم يتم ادخاله  لا يسبب اي مشكلة لنظام
<br/><h4 id="21">الترتيب</h4><br/>
هذا القسم خاص بترتيب المعلومات داخل النظام  ، يقوم النظام من استخدام معلومات في هذا القسم  ، لتنفيذ جميع الامور داخل النظام  ، و يتكون من الاقسام التالية :

</p>

	</div>
</div>
</div>
</div>
</body>
</html>